{
  "backend/main.mo": "Primary canister actor managing access control, Firebase sessions, authentication audit logs, and EPIQ wallet storage with support for private keys, recovery phrases, and chain metadata.",
  "backend/migration.mo": "Migration module converting old wallet data structures to the new format with chain, privateKey, and recoveryPhrase fields while preserving all other actor state.",
  "feature_evidence.json": "Evidence report documenting two wallet‑related features, including backend EVM wallet generation and frontend structured wallet‑creation flow updates.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptions summarizing each component’s functionality and recent updates.",
  "frontend/EPIQ_LIFE_UI_STYLE_GUIDE.md": "Comprehensive design system defining EPIQ Life’s color palette, typography, accessibility rules, and styling guidelines.",
  "frontend/index.html": "Basic HTML entry point mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "React root component configuring providers, authentication flow, initialization screens, and routing between landing, profile setup, and dashboard views.",
  "frontend/src/components/AdminTab.tsx": "Admin dashboard with tabs for managing users, courses, display name history, and testing data, including search, member-type updates, and Firebase user import.",
  "frontend/src/components/AuthMethodSelector.tsx": "UI component letting users choose between Internet Identity login or Firebase-based EPIQ Shield authentication, with a modal for Firebase login.",
  "frontend/src/components/ChecklistAnalyzer.tsx": "Generates and displays a user onboarding checklist based on profile, quest progress, wallets, and activity, with completion tracking.",
  "frontend/src/components/CourseManagementTab.tsx": "Admin interface for viewing, creating, and expanding course content, including validation and module previews.",
  "frontend/src/components/DisplayNameHistoryTab.tsx": "Displays display-name change logs with search by principal or display name, rendering paginated history tables.",
  "frontend/src/components/EmojiPicker.tsx": "Interactive emoji picker with categorized tabs, search, and callback for selecting an emoji.",
  "frontend/src/components/EpcRewardsDialog.tsx": "Dialog showing a user's EPC rewards and module completion history using queried backend data.",
  "frontend/src/components/EpiqIdAuthDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/EpiqWalletsPanel.tsx": "Panel for listing, creating, and managing user wallets with dialogs for creation and credential display.",
  "frontend/src/components/FirebaseAuthDialog.tsx": "Authentication dialog handling EPIQ ID login, Firebase verification, profile syncing, and session handling.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying EPIQ Trust copyright text.",
  "frontend/src/components/Header.tsx": "Header with branding, theme toggle, authentication controls, and user profile menu.",
  "frontend/src/components/LoadingScreen.tsx": "Displays a full-screen loading or error state with progress, retry logic, and contextual messages based on stage and retry count.",
  "frontend/src/components/MessagingTab.tsx": "Provides a messaging interface with user lookup, message fetching, sending, auto-retry, and emoji insertion.",
  "frontend/src/components/ModuleContentDialog.tsx": "Renders step‑based module content with quizzes, navigation, progress tracking, and module completion callbacks.",
  "frontend/src/components/Phase1TestingPlan.tsx": "Static UI component outlining testing steps for authentication, data consistency, and session validation.",
  "frontend/src/components/ProfileSettingsDialog.tsx": "Modal for viewing and updating user profile fields, primarily allowing display name changes with save handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Initial profile setup modal collecting name, display name, email, and member type before saving the profile.",
  "frontend/src/components/QuestTab.tsx": "Displays courses and module-based quest progress, handles backend readiness, retries, and progress updates with expandable module content.",
  "frontend/src/components/SecurityAuditLogTab.tsx": "Provides filtering, searching, exporting, and cleanup of authentication audit logs with multiple query options.",
  "frontend/src/components/UserProgressDialog.tsx": "Shows a dialog with a user’s quest and course progress, fetching related quest, module, and profile data.",
  "frontend/src/components/WalletTab.tsx": "Manages user wallet transactions, sending funds, retrying backend queries, and listing transaction history across currencies.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useEpiqId.tsx": "Empty file.",
  "frontend/src/hooks/useFirebaseAuth.tsx": "Handles Firebase authentication via backend actor, including login, syncing user data, logout, and session checks with status tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, and logout states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, rewards, quest progress, and admin actions with timeout handling.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and theme variables for light and dark modes and sets base styling utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Dashboard_REFERENCE.tsx": "Contains an unused reference dashboard layout with tab navigation retained only for design comparison.",
  "frontend/src/pages/Dashboard.tsx": "Implements a tabbed dashboard page showing user profile info, rewards, progress, and admin section using various data-fetching hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Provides a routed dashboard overview with welcome header, stats, and navigation to wallet, messages, and quest sections.",
  "frontend/src/pages/GovernanceDashboard.tsx": "Admin-only dashboard that aggregates user, course, and quest data to display EPC totals, active quests, pending actions, and completion metrics.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero content and a flow for selecting authentication methods including Internet Identity.",
  "frontend/src/pages/LaunchInitialization.tsx": "Initialization workflow that sequentially verifies authentication, backend actor readiness, and user profile loading with timeouts and error handling.",
  "frontend/src/pages/ProfileSetup.tsx": "User profile creation form that collects basic identity and wallet details and saves them via a mutation.",
  "frontend/src/utils/evmAddress.ts": "Utility functions for validating, normalizing, and truncating EVM addresses.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in session storage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing architecture, requirements, wallet constraints, and known issues for the EPIQ Life platform."
}