{
  "backend/main.mo": "Main actor module providing storage, access control, authentication audit logging, and EPIQ wallet data structures and state management.",
  "backend/migration.mo": "Migration module mapping old actor state types to new ones with a direct passthrough conversion function.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Collection of autogenerated short summaries describing the purpose of each frontend file.",
  "frontend/EPIQ_LIFE_UI_STYLE_GUIDE.md": "Design style guide defining colors, typography, layout rules, and accessibility requirements for the EPIQ Life UI.",
  "frontend/index.html": "Base HTML file that loads the React application root and main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Root React component configuring query client, theming, authentication flow, initialization logic, and routing to landing, setup, or dashboard pages.",
  "frontend/src/components/AdminTab.tsx": "Provides an admin interface with tabs for managing users, courses, display name history, and testing tools, including user search, member-type editing, and Firebase user import.",
  "frontend/src/components/AuthMethodSelector.tsx": "Renders options for selecting Internet Identity or Firebase-based authentication, including UI cards and a Firebase login dialog trigger.",
  "frontend/src/components/ChecklistAnalyzer.tsx": "Generates a user progress checklist based on profile, quests, wallet setup, and community actions, displaying completion status and overall progress.",
  "frontend/src/components/CourseManagementTab.tsx": "Implements course management tools for creating, editing, and previewing courses and modules, including quiz question editing and member-type access controls.",
  "frontend/src/components/DisplayNameHistoryTab.tsx": "Displays display-name change history with search filters for all records, by principal, or by display name, rendering results in a sortable table.",
  "frontend/src/components/EmojiPicker.tsx": "Emoji picker with categorized tabs, search, and popover UI for selecting emojis.",
  "frontend/src/components/EpcRewardsDialog.tsx": "Dialog showing a user's EPC rewards and module completion history, pulling data from multiple queries.",
  "frontend/src/components/EpiqIdAuthDialog.tsx": "Empty placeholder component with no implemented content.",
  "frontend/src/components/EpiqWalletsPanel.tsx": "Wallet management panel allowing users to create wallets, view existing ones, and handle credentials securely.",
  "frontend/src/components/FirebaseAuthDialog.tsx": "Authentication dialog handling Firebase login, session tracking, and optional user data sync.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying a copyright notice.",
  "frontend/src/components/Header.tsx": "Header with theme toggle, authentication controls, profile menu, and branding.",
  "frontend/src/components/LoadingScreen.tsx": "Full‑screen loading/error screen with retry logic, progress indicator, and staged states.",
  "frontend/src/components/MessagingTab.tsx": "Messaging UI enabling user lookup, message threads, sending messages, retries, and emoji input.",
  "frontend/src/components/ModuleContentDialog.tsx": "Dialog for completing quest modules with step navigation, quizzes, progress tracking, and completion callbacks.",
  "frontend/src/components/Phase1TestingPlan.tsx": "Static component displaying the testing checklist for authentication, data consistency, and session validation.",
  "frontend/src/components/ProfileSettingsDialog.tsx": "Dialog allowing users to edit their display name while viewing read‑only profile fields and saving updates.",
  "frontend/src/components/ProfileSetupModal.tsx": "Initial profile setup flow collecting name, display name, email, and member type before saving the profile.",
  "frontend/src/components/QuestTab.tsx": "Renders quests by combining course modules with user progress, handles backend readiness, retries, and progress updates.",
  "frontend/src/components/SecurityAuditLogTab.tsx": "Displays authentication audit logs with filtering, exporting, and session‑cleanup actions.",
  "frontend/src/components/UserProgressDialog.tsx": "Shows a user's quest and course progress in a dialog with tabs and detailed completion status.",
  "frontend/src/components/WalletTab.tsx": "Provides a wallet interface for viewing transactions, sending funds, and auto‑retrying backend queries.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains the backend actor tied to identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useEpiqId.tsx": "Empty placeholder file.",
  "frontend/src/hooks/useFirebaseAuth.tsx": "Implements Firebase‑based authentication, user‑data sync, session checks, and status tracking using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for interacting with backend actors, fetching and mutating user profiles, admin checks, transactions, rewards, and progress data with timeout handling.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes, applying global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/Dashboard_REFERENCE.tsx": "Deprecated reference version of the dashboard using tabbed navigation, kept only for design reference.",
  "frontend/src/pages/Dashboard.tsx": "Implements a tabbed dashboard UI showing user profile, rewards, progress, courses, and admin access using multiple backend query hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Implements a routed dashboard page that displays personalized stats, wallet info, course progress, and navigation shortcuts.",
  "frontend/src/pages/GovernanceDashboard.tsx": "Admin-only dashboard that loads users, courses, and progress to compute stats and navigate to sections.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero content and authentication selection for onboarding.",
  "frontend/src/pages/LaunchInitialization.tsx": "Handles multi-stage app initialization, including auth, backend actor setup, profile loading, and redirects.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile creation form allowing users to enter personal info and save a new profile.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines the project’s current architecture, wallet-handling rules, existing implemented features, and pending feature requests for the EPIQ Life platform. Emphasizes strict on-chain balance authority, user‑initiated wallet creation, and separation between Life and Treasury key management."
}