{
  "kind": "build_request",
  "title": "Generate real EVM wallet addresses and introduce scalable multi-chain wallet architecture",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Replace placeholder wallet-address generation with real EVM-compatible address derivation (MetaMask-importable) produced on the backend during the user-initiated Create Wallet action, and return the generated credentials (address, private key, recovery phrase) to the frontend exactly once.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The Wallet Addresses should be standard so that the user can add them to third-party wallets such as Meta Mask.",
          "Perfect. And can you also code it in a way where it's scalable so w we can add compatibility with other chains later?"
        ]
      },
      "acceptanceCriteria": [
        "Creating a wallet no longer yields placeholder addresses like \"generated_address_0\"; the returned address is a valid EVM address string formatted as 0x + 40 hex characters.",
        "The backend returns the newly generated private key and recovery phrase (mnemonic) as part of the Create Wallet response, and the frontend displays them in the existing one-time success dialog without generating mock values.",
        "The wallet list stores/displays the public address returned by the backend and remains capped at 9 wallets per user (caller Principal), with no automatic provisioning outside the explicit Create action."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Refactor wallet generation logic to be chain-pluggable and future-proof for adding other chains (and a potential custom chain) by introducing a backend-level chain abstraction for key/address derivation while keeping EVM as the default initial implementation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "code it in a way where it's scalable so w we can add compatibility with other chains later? We may also one day develop our very own chain."
        ]
      },
      "acceptanceCriteria": [
        "Backend defines an explicit chain identifier/type for wallets (e.g., a variant/enum), with EVM as the initial supported chain, and wallet records include which chain they belong to.",
        "Create Wallet supports selecting a chain (explicit parameter or default), and the EVM implementation produces an address compatible with third-party EVM wallets.",
        "A single, well-defined backend interface/function boundary exists for “derive address/keys for chain X”, so adding another chain later does not require rewriting wallet storage or the existing EVM path.",
        "Existing persisted wallets (from before this change) remain readable after upgrade; any newly required fields default safely (e.g., default chain = EVM) via conditional migration if state schema changes."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update the frontend EPIQ Wallet create flow to consume structured Create Wallet results (address/privateKey/seedPhrase/chain) from the backend rather than parsing a message string and generating mock credentials client-side.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The Private Keys and the Recovery Phrases are generating successfuly, but the Wallet Address only generates like this: generated_address_0, generated_address_1 — No live addresses."
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/EpiqWalletsPanel.tsx no longer generates a mock private key or mock seed phrase; it displays values returned from the backend.",
        "The frontend no longer relies on regex parsing of a backend string message to get the address; it uses explicit response fields.",
        "User-facing text remains in English and the existing “show exactly once” success-dialog behavior remains intact."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not auto-provision wallets during enrollment/profile creation/login/Firebase sync; wallets are created only when the user explicitly triggers Create Wallet in the UI.",
    "Do not modify files under frontend/src/components/ui or other frontend immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing transaction signing, sending funds, or on-chain interactions for any chain.",
    "Integrating third-party wallet connections (e.g., MetaMask browser extension APIs).",
    "Adding full UI/UX for selecting among multiple chains (beyond minimal support needed to keep the architecture extensible).",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}