{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend updates to consume structured multi-chain Create Wallet results",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Consume backend-generated EVM wallet credentials during Create Wallet and display them exactly once in the existing success dialog.",
      "acceptanceCriteria": [
        "Creating a wallet no longer yields placeholder addresses like \"generated_address_0\"; the returned address is a valid EVM address string formatted as 0x + 40 hex characters.",
        "The backend returns the newly generated private key and recovery phrase (mnemonic) as part of the Create Wallet response, and the frontend displays them in the existing one-time success dialog without generating mock values.",
        "The wallet list stores/displays the public address returned by the backend and remains capped at 9 wallets per user (caller Principal), with no automatic provisioning outside the explicit Create action."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EpiqWalletsPanel.tsx",
          "operation": "modify",
          "description": "Update the Create Wallet flow to use the structured createWallet result (address/privateKey/recoveryPhrase/chain) instead of parsing a message string; remove placeholder address handling and ensure the success dialog shows backend-provided credentials exactly once, preserving the existing acknowledgement gating and refetch-after-dismiss behavior."
        },
        {
          "path": "frontend/src/utils/evmAddress.ts",
          "operation": "create",
          "description": "Add a small frontend utility to validate/normalize EVM address strings (e.g., checks for 0x + 40 hex chars) so the UI can defensively verify the backend-provided address before displaying/copying and provide an English error toast if the format is invalid."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the wallet create mutation returns the typed structured result from backend createWallet (not a string), and invalidate/refetch wallet list queries on success so the wallets table continues to display the backend-returned public address without any client-side generation."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Refactor the EPIQ Wallet create flow to consume typed Create Wallet results (address/privateKey/seedPhrase/chain) and stop generating or parsing credentials client-side.",
      "acceptanceCriteria": [
        "frontend/src/components/EpiqWalletsPanel.tsx no longer generates a mock private key or mock seed phrase; it displays values returned from the backend.",
        "The frontend no longer relies on regex parsing of a backend string message to get the address; it uses explicit response fields.",
        "User-facing text remains in English and the existing “show exactly once” success-dialog behavior remains intact."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EpiqWalletsPanel.tsx",
          "operation": "modify",
          "description": "Remove regex parsing and mock credential generation; map backend response fields directly into the existing one-time success dialog state (including chain), keeping all user-facing text in English and preserving the current dialog open/close + acknowledgement semantics."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align the useCreateWallet hook typings and returned value shape with the backend interface so EpiqWalletsPanel receives explicit fields (address/privateKey/recoveryPhrase/chain/walletId) and never needs to parse strings or fabricate credentials."
        }
      ]
    }
  ]
}